export type DepartmentType = {
  "Все сервисы": never[]
  "ICT": string[]
  "HR": string[]
  "Согл. док-та": string[]
  "Финансы": string[]
}

export const departments: DepartmentType = {
  "Все сервисы": [],
  "ICT": [
    "Доступ к системам",
    "Установка ПО",
    "Настройка оборудования",
  ],
  "HR": [
    "Очередной оплачиваемый отпуск",
    "Отпуск без сохранения з/п",
    "Отпуск по беременности и родам",
    "Отпуск по уходу за ребенком до 1,5 лет",
    "Отпуск по уходу за ребенком до 3 лет",
    "Учебный отпуск",
  ],
  "Согл. док-та": [
    "Согласование договора",
    "Согласование приказа",
    "Согласование служебной записки",
  ],
  "Финансы": [
    "Авансовый отчет",
    "Заявка на оплату",
    "Справка 2-НДФЛ",
  ],
}

export const mostLikelyRequests = [
  "Очередной оплачиваемый отпуск",
  "Доступ к системам",
  "Согласование договора",
  "Авансовый отчет",
  "Установка ПО",
  "Справка 2-НДФЛ",
  "Отпуск без сохранения з/п",
  "Согласование приказа",
] as const